## Pandas

#### Pandas is a Python library used for working with data sets.

#### It has functions for analyzing, cleaning, exploring, and manipulating data.

- Pandas allows us to analyze big data and make conclusions based on statistical theories.

- Pandas can clean messy data sets, and make them readable and relevant.

- Relevant data is very important in data science.

### Pandas Data Structure

- Series (1 Dimensional)
- DataFrame (2 Dimensional)

### Series  (1 Dimensional)

A Series is a one-dimensional labeled array in pandas. It can hold data of various types, including integers, floats, strings, and more.

# syntax

pd.Series(variable_name)     # Series  -->S capital in Series

#### import libary

In [65]:
import pandas as pd

#### Creating Series :

- list
- tuple
- dictionary
- Array

### list

In [66]:
# Creating a Series using a list

l1 =[10,20,30,40,50,60,70]

l1

[10, 20, 30, 40, 50, 60, 70]

#### example

In [3]:


a1 =pd.Series(l1)

a1

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [12]:
a1[4]

50

In [4]:
type(a1)

pandas.core.series.Series

#### dictionary

In [67]:
# Creating a Series using a dictionary

d = {1:"One",2:"two",3:"three",4:"four"}

d

{1: 'One', 2: 'two', 3: 'three', 4: 'four'}

In [68]:
# example

s2=pd.Series(d)

s2

1      One
2      two
3    three
4     four
dtype: object

In [69]:
type(s2)

pandas.core.series.Series

### set

In [70]:
set1 = {1,2,3,4,5,6,7}      # Attempting to create a Series from a set (which is not supported)

set1

{1, 2, 3, 4, 5, 6, 7}

In [71]:
s2=pd.Series(set1)

s2

TypeError: 'set' type is unordered

#### array

In [10]:
import numpy as np

In [13]:
n1 =np.arange(1,11)

n1

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [14]:
s3=pd.Series(n1)

s3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

In [15]:
type(s3)

pandas.core.series.Series

In [16]:
s3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

### Rename

rename->index
replace->values

#### syntax

#syntax

variable_name.rename({old_index:new_index,old_index:new_index},inplace=True)

In [17]:
s3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

In [20]:
# example


s4 =s3.rename({2:"two"},inplace=True)       # Renaming index labels of a Series

s4

In [83]:
s4[9]

9     3
9    10
dtype: int32

In [21]:
s3

0       1
1       2
two     3
3       4
4       5
5       6
6       7
7       8
8       9
9      10
dtype: int32

In [82]:
s3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

In [76]:
s3

0       1
1       2
two     3
3       4
4       5
5       6
6       7
7       8
8       9
9      10
dtype: int32

### replace()

#### replace single value

syntax:
    varaible_name.replace(old_vlaue,New_value,inplace=True)

#### replace Multiple values

syntax:
variable_name.replace([old_value1,old_value2,___old_valueN],[New_value1,New_value2,...New_valueN],inplace=True)

In [61]:
a1

6    70
5    60
4    50
3    40
2    30
1    20
0    10
dtype: int64

In [63]:
a1.replace([30,50,70],[300,500,700])

6    700
5     60
4    500
3     40
2    300
1     20
0     10
dtype: int64

#### example

In [22]:
# replace single value


a1

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [24]:
# example

s5=a1.replace(40,400)          # Replacing values in a Series

s5

0     10
1     20
2     30
3    400
4     50
5     60
6     70
dtype: int64

In [87]:
a1

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

### sort_index()

variable_name.sort_index()         ->ascending

variable_name.sort_index(ascending=False)     ->decending

In [30]:
names =['Deoyani','Tanvi','Neha','Rushabh','Sameer','Chaitanya','Alankar','Kapil','Sujit','Pavan']


names

['Deoyani',
 'Tanvi',
 'Neha',
 'Rushabh',
 'Sameer',
 'Chaitanya',
 'Alankar',
 'Kapil',
 'Sujit',
 'Pavan']

In [31]:
s6=pd.Series(names)

s6

0      Deoyani
1        Tanvi
2         Neha
3      Rushabh
4       Sameer
5    Chaitanya
6      Alankar
7        Kapil
8        Sujit
9        Pavan
dtype: object

In [90]:
type(s6)

pandas.core.series.Series

#### example

In [92]:
v1= s6.sort_index()

v1

0      Deoyani
1        Tanvi
2         Neha
3      Rushabh
4       Sameer
5    Chaitanya
6      Alankar
7        Kapil
8        Sujit
9        Pavan
dtype: object

In [93]:
v2= s6.sort_index(ascending=False)

v2

9        Pavan
8        Sujit
7        Kapil
6      Alankar
5    Chaitanya
4       Sameer
3      Rushabh
2         Neha
1        Tanvi
0      Deoyani
dtype: object

### sort_values()

In [26]:
a1

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [27]:
# example

v3=a1.sort_values(inplace=True)

v3

In [107]:
a1

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [101]:
a1

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [28]:
v4=a1.sort_values(ascending=False,inplace=True)

v4

In [103]:
a1

6    70
5    60
4    50
3    40
2    30
1    20
0    10
dtype: int64

In [32]:
s6

0      Deoyani
1        Tanvi
2         Neha
3      Rushabh
4       Sameer
5    Chaitanya
6      Alankar
7        Kapil
8        Sujit
9        Pavan
dtype: object

In [34]:
v6=s6.sort_values()

v6

6      Alankar
5    Chaitanya
0      Deoyani
7        Kapil
2         Neha
9        Pavan
3      Rushabh
4       Sameer
8        Sujit
1        Tanvi
dtype: object

In [33]:
v5=s6.sort_values(ascending=False)

v5

1        Tanvi
8        Sujit
4       Sameer
3      Rushabh
9        Pavan
2         Neha
7        Kapil
0      Deoyani
5    Chaitanya
6      Alankar
dtype: object

In [104]:
a1

6    70
5    60
4    50
3    40
2    30
1    20
0    10
dtype: int64

In [35]:
m1 = pd.Series([1,2,3,4,5])

m2 = pd.Series([1,2,3,4,5])

In [37]:
m1+m2

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [38]:
m1*m2

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [36]:
c= m1**m2

c

0       1
1       4
2      27
3     256
4    3125
dtype: int64

In [122]:
c[3]

256

In [115]:
#################################################################################

### DataFrame()

- A DataFrame is a two-dimensional labeled data structure in pandas.It's similar to a table in a relational database or an Excel spreadsheet.

- A DataFrame consists of multiple Series organized as columns, and each column can hold data of different types.

In [42]:
df = pd.DataFrame([[10,20,30,45],[22,56,78,45],[4,8,2,78],[23,67,45,67]])

df

    0   1   2   3
0  10  20  30  45
1  22  56  78  45
2   4   8   2  78
3  23  67  45  67

syntax:
    
df[column][row]

#### example

In [43]:
df[3][3]       # Accessing values in a DataFrame

67

In [44]:
df

    0   1   2   3
0  10  20  30  45
1  22  56  78  45
2   4   8   2  78
3  23  67  45  67

## read files

In [ ]:
pd.read_excel(file_name)


r'C:\Users\Acer\FIREBLAZE\Python_fulltime_batch_August\Employee.csv'

### read_csv()

In [62]:
df2 = pd.read_csv(r"Employee.csv")

df2

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [47]:
df = pd.read_csv(r"C:\Users\Acer\FIREBLAZE\Employee.csv")    # encoding="latin"

df

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [48]:
df

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

### head()

In [49]:
df.head()

     Id gender    city  experience   salary
0  1001      M    pune           1  10000.0
1  1002      F  mumbai           5  50000.0
2  1003      M    pune           4      NaN
3  1004      M    beed           6  60000.0
4  1005      F    beed           7  70000.0

In [50]:
df.head(12)              # Displaying the first few rows of a DataFrame

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0

### tail()

In [51]:
df.tail()                          # Displaying the last few rows of a DataFrame

      Id gender      city  experience   salary
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [52]:
df.tail(10)

      Id gender      city  experience   salary
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [55]:
df

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

### info()

In [53]:
df.info()                    # Getting information about a DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Id          15 non-null     int64
 1   gender      15 non-null     object
 2   city        15 non-null     object
 3   experience  15 non-null     int64
 4   salary      14 non-null     float64
dtypes: float64(1), int64(2), object(2)
memory usage: 728.0+ bytes

### describe()

In [54]:
df.describe()           # Describing the statistical summary of a DataFrame

                Id  experience        salary
count    15.000000   15.000000     14.000000
mean   1008.000000    4.933333  50000.000000
std       4.472136    2.491892  25720.389996
min    1001.000000    1.000000  10000.000000
25%    1004.500000    3.500000  32500.000000
50%    1008.000000    5.000000  50000.000000
75%    1011.500000    6.500000  67500.000000
max    1015.000000    9.000000  90000.000000

### sample()

In [57]:
df.sample()             # Sampling random rows from a DataFrame

     Id gender      city  experience   salary
5  1006      M  bhandara           5  50000.0

In [60]:
df.sample(5)

      Id gender    city  experience   salary
0   1001      M    pune           1  10000.0
6   1007      F    beed           2  20000.0
11  1012      F  gondia           4  40000.0
10  1011      M  nagpur           9  90000.0
8   1009      F  nagpur           6  60000.0